#include "buzzer.h"
#define BUZZ (D7)

uint16 count_beep = 0;                  // 蜂鸣器计数器

/*
------------------------------------------------------------------------------------------------------------------
函数简介     蜂鸣器计数
参数说明     无
返回参数     无
使用示例     BUZZ_start()
备注信息     无
-------------------------------------------------------------------------------------------------------------------
*/
void BUZZ_init(void)
{
		gpio_init(BUZZ,GPO,GPIO_LOW,GPO_PUSH_PULL);
}

/*
------------------------------------------------------------------------------------------------------------------
函数简介     蜂鸣器开响
参数说明     无
返回参数     无
使用示例     beep_cycle();
备注信息     无
-------------------------------------------------------------------------------------------------------------------
*/
void BUZZ_START(void)
{
    count_beep=7;
}
void BUZZ_cycle(void)
{
    if(count_beep)
    {
        gpio_set_level(BUZZ,GPIO_HIGH);
        count_beep--;
    }
    else
    {
        gpio_set_level(BUZZ,GPIO_LOW);
    }

}